// Вызвать канвас

// Обратиться к контексту

// Создать функцию draw

// Внутри функции draw закрасить черным канвас

// Вызвать функцию drawMatrix

// Создать функцию drawMatrix
// Она принимает 2 аргумента matrix, offset

// Внутри функции matrix пройтись по всем
// строкам матрицы и забрать первым аргументом строку
// вторым значение по оси y
// далее внутри первого цикла пройтись по массиву
// row и забрать первым аргументом value, вторым
// значение по оси x
// если значение не равно нулю
// закрасить контекст красным
// и определить его размеры 1px на 1px
// по оси x равно x плюс offset.x и так же для y

// Создать функцию update

// Вызвать в ней функцию draw

// Создать объект player со значениями
// pos в котором значения в виде объекта для
// x и y
// А так же значение для матрицы

// Вызвать функцию update